### Into to Dataframe

In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame([[1, 2, 3], [4, 5, 6], [7, 8, 9]], columns=['A', 'B', 'C'])
df.head()

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [3]:
df.columns

Index(['A', 'B', 'C'], dtype='object')

In [4]:
df.index.to_list()

[0, 1, 2]

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       3 non-null      int64
 1   B       3 non-null      int64
 2   C       3 non-null      int64
dtypes: int64(3)
memory usage: 200.0 bytes

In [6]:
df.describe()

         A    B    C
count  3.0  3.0  3.0
mean   4.0  5.0  6.0
std    3.0  3.0  3.0
min    1.0  2.0  3.0
25%    2.5  3.5  4.5
50%    4.0  5.0  6.0
75%    5.5  6.5  7.5
max    7.0  8.0  9.0

In [7]:
df.shape

(3, 3)

In [8]:
df.size

9

### Loading data

In [18]:
df = pd.read_csv('data/coffee.csv')

In [10]:
df.head()

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          15
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35

In [11]:
df = pd.read_parquet('data/results.parquet')

In [12]:
df.head()

,year,type,discipline,event,as,athlete_id,noc,team,place,tied,medal
0,1912.0,Summer,Tennis,"Singles, Men (Olympic)",Jean-François Blanchy,1,FRA,None,17.0,True,None
1,1912.0,Summer,Tennis,"Doubles, Men (Olympic)",Jean-François Blanchy,1,FRA,Jean Montariol,NaN,False,None
2,1920.0,Summer,Tennis,"Singles, Men (Olympic)",Jean-François Blanchy,1,FRA,None,32.0,True,None
3,1920.0,Summer,Tennis,"Doubles, Mixed (Olympic)",Jean-François Blanchy,1,FRA,Jeanne Vaussard,8.0,True,None
4,1920.0,Summer,Tennis,"Doubles, Men (Olympic)",Jean-François Blanchy,1,FRA,Jacques Brugnon,4.0,False,None

### Accessing data with pandas

In [19]:
display(df)

          Day Coffee Type  Units Sold
0      Monday    Espresso          25
1      Monday       Latte          15
2     Tuesday    Espresso          30
3     Tuesday       Latte          20
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

In [20]:
print(df)

          Day Coffee Type  Units Sold
0      Monday    Espresso          25
1      Monday       Latte          15
2     Tuesday    Espresso          30
3     Tuesday       Latte          20
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

In [21]:
df.head()

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          15
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35

In [22]:
df.tail()

         Day Coffee Type  Units Sold
9     Friday       Latte          35
10  Saturday    Espresso          45
11  Saturday       Latte          35
12    Sunday    Espresso          45
13    Sunday       Latte          35

In [23]:
df

          Day Coffee Type  Units Sold
0      Monday    Espresso          25
1      Monday       Latte          15
2     Tuesday    Espresso          30
3     Tuesday       Latte          20
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

In [24]:
df.sample(5)

          Day Coffee Type  Units Sold
7    Thursday       Latte          30
2     Tuesday    Espresso          30
13     Sunday       Latte          35
9      Friday       Latte          35
5   Wednesday       Latte          25

In [25]:
df.loc[0]

Day              Monday
Coffee Type    Espresso
Units Sold           25
Name: 0, dtype: object

In [26]:
df.loc[[0,3,7]]

        Day Coffee Type  Units Sold
0    Monday    Espresso          25
3   Tuesday       Latte          20
7  Thursday       Latte          30

In [27]:
df.loc[2:5]

         Day Coffee Type  Units Sold
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35
5  Wednesday       Latte          25

In [28]:
df.loc[2:5, ['Day', 'Units Sold']]

         Day  Units Sold
2    Tuesday          30
3    Tuesday          20
4  Wednesday          35
5  Wednesday          25

In [29]:
df.loc[:, ['Day', 'Units Sold']]

          Day  Units Sold
0      Monday          25
1      Monday          15
2     Tuesday          30
3     Tuesday          20
4   Wednesday          35
5   Wednesday          25
6    Thursday          40
7    Thursday          30
8      Friday          45
9      Friday          35
10   Saturday          45
11   Saturday          35
12     Sunday          45
13     Sunday          35

In [30]:
df.iloc[:, [0,2]]

          Day  Units Sold
0      Monday          25
1      Monday          15
2     Tuesday          30
3     Tuesday          20
4   Wednesday          35
5   Wednesday          25
6    Thursday          40
7    Thursday          30
8      Friday          45
9      Friday          35
10   Saturday          45
11   Saturday          35
12     Sunday          45
13     Sunday          35

In [31]:
df.loc[1, "Units Sold"] = 27
df.head()

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          27
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35

In [32]:
df.at[1, "Units Sold"]

27

In [33]:
df.iat[1, 2]

27

In [34]:
df["Units Sold"]

0     25
1     27
2     30
3     20
4     35
5     25
6     40
7     30
8     45
9     35
10    45
11    35
12    45
13    35
Name: Units Sold, dtype: int64

In [35]:
df.Day

0        Monday
1        Monday
2       Tuesday
3       Tuesday
4     Wednesday
5     Wednesday
6      Thursday
7      Thursday
8        Friday
9        Friday
10     Saturday
11     Saturday
12       Sunday
13       Sunday
Name: Day, dtype: object

In [37]:
df.sort_values(by="Units Sold", ascending=False)

          Day Coffee Type  Units Sold
8      Friday    Espresso          45
10   Saturday    Espresso          45
12     Sunday    Espresso          45
6    Thursday    Espresso          40
4   Wednesday    Espresso          35
9      Friday       Latte          35
11   Saturday       Latte          35
13     Sunday       Latte          35
2     Tuesday    Espresso          30
7    Thursday       Latte          30
1      Monday       Latte          27
0      Monday    Espresso          25
5   Wednesday       Latte          25
3     Tuesday       Latte          20

In [38]:
df.sort_values(by=["Units Sold", "Day"], ascending=False)

          Day Coffee Type  Units Sold
12     Sunday    Espresso          45
10   Saturday    Espresso          45
8      Friday    Espresso          45
6    Thursday    Espresso          40
4   Wednesday    Espresso          35
13     Sunday       Latte          35
11   Saturday       Latte          35
9      Friday       Latte          35
2     Tuesday    Espresso          30
7    Thursday       Latte          30
1      Monday       Latte          27
5   Wednesday       Latte          25
0      Monday    Espresso          25
3     Tuesday       Latte          20

In [39]:
df.sort_values(by=["Units Sold", "Day"], ascending=[False, True])

          Day Coffee Type  Units Sold
8      Friday    Espresso          45
10   Saturday    Espresso          45
12     Sunday    Espresso          45
6    Thursday    Espresso          40
9      Friday       Latte          35
11   Saturday       Latte          35
13     Sunday       Latte          35
4   Wednesday    Espresso          35
7    Thursday       Latte          30
2     Tuesday    Espresso          30
1      Monday       Latte          27
0      Monday    Espresso          25
5   Wednesday       Latte          25
3     Tuesday       Latte          20

In [40]:
df.sort_values(by=["Units Sold", "Day"], ascending=[0, 1])

          Day Coffee Type  Units Sold
8      Friday    Espresso          45
10   Saturday    Espresso          45
12     Sunday    Espresso          45
6    Thursday    Espresso          40
9      Friday       Latte          35
11   Saturday       Latte          35
13     Sunday       Latte          35
4   Wednesday    Espresso          35
7    Thursday       Latte          30
2     Tuesday    Espresso          30
1      Monday       Latte          27
0      Monday    Espresso          25
5   Wednesday       Latte          25
3     Tuesday       Latte          20

### Filtering Data

In [41]:
bios = pd.read_csv('data/bios.csv')

In [42]:
bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25

In [48]:
bios.loc[bios["height_cm"] > 215, ["name", "height_cm"]]

                         name  height_cm
5089       Viktor Pankrashkin      220.0
5583     Paulinho Villas Boas      217.0
5673           Gunther Behnke      221.0
5716                 Uwe Blab      218.0
5781           Tommy Burleson      223.0
5796            Andy Campbell      218.0
6223              Lars Hansen      216.0
6270              Hu Zhangbao      216.0
6409         Sergey Kovalenko      216.0
6420            Jānis Krūmiņš      218.0
6504              Luc Longley      220.0
6722         Shaquille O'Neal      216.0
6937           David Robinson      216.0
6978          Arvydas Sabonis      223.0
7074           Paulo da Silva      217.0
7188       Vladimir Tkachenko      220.0
7281         Stojko Vranković      217.0
7376      Eurelijus Žukauskas      218.0
52608         Aleksey Kazakov      217.0
82100           Frédéric Weis      218.0
89070                Yao Ming      226.0
89075          Roberto Dueñas      221.0
107408       Peter John Ramos      219.0
112312           Stanko Barać      217.0
112332    Andreas Glyniadakis      216.0
112337          Hamed Haddadi      218.0
118663         Timofey Mozgov      216.0
118676        Dmitry Musersky      219.0
120266           Zhang Zhaoxu      221.0
121694            Salah Mejri      216.0
123850         Tyson Chandler      216.0
130460               Li Muhao      218.0
130461                Zhou Qi      217.0
138671          Ondřej Balvín      216.0
139365         Moustapha Fall      218.0

In [53]:
bios[(bios["height_cm"] > 215) & (bios['weight_kg'] > 100)][["name", "height_cm", "weight_kg"]]

                         name  height_cm  weight_kg
5089       Viktor Pankrashkin      220.0      112.0
5583     Paulinho Villas Boas      217.0      106.0
5673           Gunther Behnke      221.0      114.0
5716                 Uwe Blab      218.0      110.0
5781           Tommy Burleson      223.0      102.0
6223              Lars Hansen      216.0      105.0
6270              Hu Zhangbao      216.0      135.0
6409         Sergey Kovalenko      216.0      111.0
6420            Jānis Krūmiņš      218.0      141.0
6504              Luc Longley      220.0      135.0
6722         Shaquille O'Neal      216.0      137.0
6937           David Robinson      216.0      107.0
6978          Arvydas Sabonis      223.0      122.0
7074           Paulo da Silva      217.0      106.0
7188       Vladimir Tkachenko      220.0      110.0
7281         Stojko Vranković      217.0      115.0
7376      Eurelijus Žukauskas      218.0      115.0
52608         Aleksey Kazakov      217.0      102.0
82100           Frédéric Weis      218.0      110.0
89070                Yao Ming      226.0      141.0
89075          Roberto Dueñas      221.0      137.0
107408       Peter John Ramos      219.0      113.0
112312           Stanko Barać      217.0      110.0
112332    Andreas Glyniadakis      216.0      115.0
112337          Hamed Haddadi      218.0      110.0
118663         Timofey Mozgov      216.0      113.0
118676        Dmitry Musersky      219.0      104.0
120266           Zhang Zhaoxu      221.0      110.0
121694            Salah Mejri      216.0      110.0
123850         Tyson Chandler      216.0      107.0
130460               Li Muhao      218.0      115.0
138671          Ondřej Balvín      216.0      107.0

In [54]:
bios[(bios["height_cm"] > 215) & (bios['weight_kg'] > 100) & (bios['born_country'] == 'USA')][["name", "height_cm", "weight_kg", "born_country"]]

                    name  height_cm  weight_kg born_country
5781      Tommy Burleson      223.0      102.0          USA
6722    Shaquille O'Neal      216.0      137.0          USA
6937      David Robinson      216.0      107.0          USA
123850    Tyson Chandler      216.0      107.0          USA

In [59]:
bios[bios["name"].str.contains("Neal|Shaq", case=False)][["name", "height_cm"]]

                         name  height_cm
6722         Shaquille O'Neal      216.0
11357       Cindy Neale-Ishoy      159.0
12224             Neale Lavis      171.0
12670            Neal Shapiro      175.0
22005            Neal Mallett      188.0
25072              Jack Neale        NaN
28272   Margaret Thomas-Neale      152.0
29918               Ian Neale      180.0
42060             George Neal        NaN
44289             Neal Caloia      185.0
44760              Gail Neall      163.0
58122              Neal Kranz      190.0
62445         O'Neal Marshall      178.0
62491           Neal McDonald      183.0
73858       Syed Meshaq Rizvi      175.0
77338            Lacey O'Neal      170.0
78244          McClinton Neal      193.0
83732             Neal Broten      175.0
91430           Neal Marshall      182.0
91870              Neal Byrne      185.0
94999              Bill Neale        NaN
112185            Blaine Neal      196.0
112681          Teneal Attard      161.0
120006         Mark Kenneally      192.0
123856         Teneale Hatton      167.0
124392               Lia Neal      178.0
126687             Leah Neale      173.0
128726            Brooke Neal      182.0
131286             Tim Kneale      187.0
132506              Shay Neal      176.0
139726           Neal Skupski        NaN
143978        Shaquille Moosa        NaN

In [61]:
bios[bios["born_country"].isin(["USA", "GBR"])][["name", "born_country"]]

                     name born_country
4            Albert Canet          GBR
37        Helen Aitchison          GBR
38      Geraldine Beamish          GBR
39           Dora Boothby          GBR
40         Julie Bradbury          GBR
...                   ...          ...
145445     Kristen Santos          USA
145446   Corinne Stoddard          USA
145454      Anna Hoffmann          USA
145457     Alix Wilkinson          USA
145468  Justin Abdelkader          USA

[15433 rows x 2 columns]

In [64]:
bios[bios["name"].str.startswith("Anu")][["name"]]

                              name
39939   Anushavan Gassan-Dzhalilov
42795                   Anuj Desai
44650               Anush Manukyan
46298                 Anu Koivisto
65049              Anubes da Silva
66817                Anu Kaljurand
67001                Anu Pirttimaa
74531                 Anuța Cătună
76223              Anuwat Sermsiri
80508              Anuschka Gläser
82060       Anu Weckström-Nieminen
107001                  Anuj Kumar
107169             Anuradha Cooray
111590                Anup Sridhar
111750         Anuruddha Ratnayake
120276                 Anum Bandey
128049           Anuradha Thokchom
142051    Anuoluwapo Juwon Opeyori

In [65]:
bios.query('born_country == "GBR" and height_cm > 210')[["name", "height_cm", "born_country"]]

                    name  height_cm born_country
121042  Robert Archibald      211.0          GBR
140298  Aaron Geramipoor      214.0          GBR

### Adding / Removing columns

In [66]:
coffee = pd.read_csv('data/coffee.csv')

In [67]:
coffee.head()

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          15
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35

In [68]:
coffee["price"] = 4.99

In [69]:
coffee.head()

         Day Coffee Type  Units Sold  price
0     Monday    Espresso          25   4.99
1     Monday       Latte          15   4.99
2    Tuesday    Espresso          30   4.99
3    Tuesday       Latte          20   4.99
4  Wednesday    Espresso          35   4.99

In [70]:
import numpy as np

In [71]:
coffee["price"] = np.where(coffee["Coffee Type"]=='Espresso', 3.99, 4.99)

In [72]:
coffee.head()

         Day Coffee Type  Units Sold  price
0     Monday    Espresso          25   3.99
1     Monday       Latte          15   4.99
2    Tuesday    Espresso          30   3.99
3    Tuesday       Latte          20   4.99
4  Wednesday    Espresso          35   3.99

In [73]:
coffee.drop(columns=["price"], inplace=True)

In [74]:
coffee.head()

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          15
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35

In [75]:
coffee["price"] = np.where(coffee["Coffee Type"]=='Espresso', 3.99, 4.99)

In [76]:
coffee['revenue'] = coffee['Units Sold'] * coffee['price']

In [77]:
coffee.head()

         Day Coffee Type  Units Sold  price  revenue
0     Monday    Espresso          25   3.99    99.75
1     Monday       Latte          15   4.99    74.85
2    Tuesday    Espresso          30   3.99   119.70
3    Tuesday       Latte          20   4.99    99.80
4  Wednesday    Espresso          35   3.99   139.65

In [78]:
bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25

In [79]:
bios['first_name'] = bios['name'].str.split(" ").str[0]

In [80]:
bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,first_name
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Jean-François
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,Arnaud
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17,Jean
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,Jacques
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,Albert

In [81]:
bios['born_datetime'] = pd.to_datetime(bios['born_date'])

In [82]:
bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,first_name,born_datetime
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Jean-François,1886-12-12
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,Arnaud,1969-04-01
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17,Jean,1898-08-13
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,Jacques,1895-05-11
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,Albert,1878-04-17

In [83]:
bios.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 145500 entries, 0 to 145499
Data columns (total 12 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   athlete_id     145500 non-null  int64
 1   name           145500 non-null  object
 2   born_date      143693 non-null  object
 3   born_city      110908 non-null  object
 4   born_region    110908 non-null  object
 5   born_country   110908 non-null  object
 6   NOC            145499 non-null  object
 7   height_cm      106651 non-null  float64
 8   weight_kg      102070 non-null  float64
 9   died_date      33940 non-null   object
 10  first_name     145500 non-null  object
 11  born_datetime  143693 non-null  datetime64[ns]
dtypes: datetime64[ns](1), float64(2), int64(1), object(8)
memory usage: 13.3+ MB

In [84]:
bios['born_datetime'].dt.year

0         1886.0
1         1969.0
2         1898.0
3         1895.0
4         1878.0
           ...
145495    2002.0
145496    1999.0
145497    1998.0
145498    1899.0
145499    1913.0
Name: born_datetime, Length: 145500, dtype: float64

In [87]:
bios[bios['born_datetime'].dt.is_leap_year][['name', 'born_date']]

                        name   born_date
8              Marcel Cousin  1896-08-04
9         Guy de la Chapelle  1868-07-16
17      Jean-Philippe Gatien  1968-10-16
21              René Lacoste  1904-07-02
32          Stéphane Renault  1968-03-01
...                      ...         ...
145483               Feng He  2004-03-31
145484            Gao Hongbo  2000-10-20
145485          Radek Houser  1996-07-02
145487     Yekaterina Kosova  1996-04-25
145489            Ye Jielong  2000-03-02

[35727 rows x 2 columns]

In [90]:
bios['height_category'] = pd.cut(bios['height_cm'], bins=[0, 180, 200, 250], labels=['Short', 'Average', 'Tall'])

In [93]:
bios['height_cat'] = bios['height_cm'].apply(lambda x: 'Tall' if x > 200 else ('Average' if x > 180 else 'Short'))

In [94]:
bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,first_name,born_datetime,height_category,height_cat
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Jean-François,1886-12-12,NaN,Short
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,Arnaud,1969-04-01,Average,Average
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17,Jean,1898-08-13,Average,Average
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,Jacques,1895-05-11,Short,Short
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,Albert,1878-04-17,NaN,Short

In [95]:
def categorize_athelete(row):
    if row['height_cm'] < 175 and row['weight_kg'] < 70:
        return 'Lightweight'
    elif row['height_cm'] <= 200 and row['weight_kg'] <= 100:
        return 'Middleweight'
    else:
        return 'Heavyweight'

bios['catehory'] = bios.apply(categorize_athelete, axis=1)

In [96]:
bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,first_name,born_datetime,height_category,height_cat,catehory
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Jean-François,1886-12-12,NaN,Short,Heavyweight
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,Arnaud,1969-04-01,Average,Average,Middleweight
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17,Jean,1898-08-13,Average,Average,Middleweight
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,Jacques,1895-05-11,Short,Short,Lightweight
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,Albert,1878-04-17,NaN,Short,Heavyweight

### Merging And Concatenating Data

In [132]:
coffee = pd.read_csv('data/coffee.csv')
coffee_prices = pd.read_csv('data/coffee_prices.csv')

In [133]:
coffee.head()

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          15
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35

In [134]:
coffee_prices.head()

  Coffee Type  Price
0    Espresso    120
1       Latte    150
2  Cappuccino    160

In [135]:
coffee = pd.merge(coffee, coffee_prices, on='Coffee Type', how='inner')

In [136]:
coffee

          Day Coffee Type  Units Sold  Price
0      Monday    Espresso          25    120
1     Tuesday    Espresso          30    120
2   Wednesday    Espresso          35    120
3    Thursday    Espresso          40    120
4      Friday    Espresso          45    120
5    Saturday    Espresso          45    120
6      Sunday    Espresso          45    120
7      Monday       Latte          15    150
8     Tuesday       Latte          20    150
9   Wednesday       Latte          25    150
10   Thursday       Latte          30    150
11     Friday       Latte          35    150
12   Saturday       Latte          35    150
13     Sunday       Latte          35    150

In [106]:
bios = pd.read_csv('data/bios.csv')

In [107]:
usa_df = bios[bios['born_country'] == 'USA'].copy()
gbr_df = bios[bios['born_country'] == 'GBR'].copy()

In [108]:
new_df = pd.concat([usa_df, gbr_df], ignore_index=True)

In [109]:
new_df.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,55,Monique Javer,1967-07-22,Burlingame,California,USA,Great Britain,177.0,64.0,NaN
1,964,Xóchitl Escobedo,1968-09-17,West Covina,California,USA,Mexico,170.0,60.0,NaN
2,965,Angélica Gavaldón,1973-10-03,El Centro,California,USA,Mexico,160.0,54.0,NaN
3,1238,Bert Schneider,1897-07-01,Cleveland,Ohio,USA,Canada,NaN,NaN,1986-02-20
4,1352,Laura Berg,1975-01-06,Santa Fe Springs,California,USA,United States,168.0,61.0,NaN

In [110]:
new_df.shape

(15433, 10)

### Handling Null values

In [115]:
coffee.loc[[0,1], ['Units Sold']] = np.nan

In [112]:
coffee

          Day Coffee Type  Units Sold  Price
0      Monday    Espresso         NaN    120
1     Tuesday    Espresso         NaN    120
2   Wednesday    Espresso        35.0    120
3    Thursday    Espresso        40.0    120
4      Friday    Espresso        45.0    120
5    Saturday    Espresso        45.0    120
6      Sunday    Espresso        45.0    120
7      Monday       Latte        15.0    150
8     Tuesday       Latte        20.0    150
9   Wednesday       Latte        25.0    150
10   Thursday       Latte        30.0    150
11     Friday       Latte        35.0    150
12   Saturday       Latte        35.0    150
13     Sunday       Latte        35.0    150

In [120]:
coffee.fillna({'Units Sold': 10}, inplace=True)

In [114]:
coffee

          Day Coffee Type  Units Sold  Price
0      Monday    Espresso        10.0    120
1     Tuesday    Espresso        10.0    120
2   Wednesday    Espresso        35.0    120
3    Thursday    Espresso        40.0    120
4      Friday    Espresso        45.0    120
5    Saturday    Espresso        45.0    120
6      Sunday    Espresso        45.0    120
7      Monday       Latte        15.0    150
8     Tuesday       Latte        20.0    150
9   Wednesday       Latte        25.0    150
10   Thursday       Latte        30.0    150
11     Friday       Latte        35.0    150
12   Saturday       Latte        35.0    150
13     Sunday       Latte        35.0    150

In [116]:
coffee.fillna(coffee['Units Sold'].mean())

          Day Coffee Type  Units Sold  Price
0      Monday    Espresso       33.75    120
1     Tuesday    Espresso       33.75    120
2   Wednesday    Espresso       35.00    120
3    Thursday    Espresso       40.00    120
4      Friday    Espresso       45.00    120
5    Saturday    Espresso       45.00    120
6      Sunday    Espresso       45.00    120
7      Monday       Latte       15.00    150
8     Tuesday       Latte       20.00    150
9   Wednesday       Latte       25.00    150
10   Thursday       Latte       30.00    150
11     Friday       Latte       35.00    150
12   Saturday       Latte       35.00    150
13     Sunday       Latte       35.00    150

In [122]:
coffee.loc[[8,9], ['Units Sold']] = np.nan

In [123]:
coffee

          Day Coffee Type  Units Sold  Price
0      Monday    Espresso        10.0    120
1     Tuesday    Espresso        10.0    120
2   Wednesday    Espresso        35.0    120
3    Thursday    Espresso        40.0    120
4      Friday    Espresso        45.0    120
5    Saturday    Espresso        45.0    120
6      Sunday    Espresso        45.0    120
7      Monday       Latte        15.0    150
8     Tuesday       Latte         NaN    150
9   Wednesday       Latte         NaN    150
10   Thursday       Latte        30.0    150
11     Friday       Latte        35.0    150
12   Saturday       Latte        35.0    150
13     Sunday       Latte        35.0    150

In [124]:
coffee.fillna(coffee['Units Sold'].interpolate())

          Day Coffee Type  Units Sold  Price
0      Monday    Espresso        10.0    120
1     Tuesday    Espresso        10.0    120
2   Wednesday    Espresso        35.0    120
3    Thursday    Espresso        40.0    120
4      Friday    Espresso        45.0    120
5    Saturday    Espresso        45.0    120
6      Sunday    Espresso        45.0    120
7      Monday       Latte        15.0    150
8     Tuesday       Latte         NaN    150
9   Wednesday       Latte         NaN    150
10   Thursday       Latte        30.0    150
11     Friday       Latte        35.0    150
12   Saturday       Latte        35.0    150
13     Sunday       Latte        35.0    150

In [125]:
coffee.dropna()

          Day Coffee Type  Units Sold  Price
0      Monday    Espresso        10.0    120
1     Tuesday    Espresso        10.0    120
2   Wednesday    Espresso        35.0    120
3    Thursday    Espresso        40.0    120
4      Friday    Espresso        45.0    120
5    Saturday    Espresso        45.0    120
6      Sunday    Espresso        45.0    120
7      Monday       Latte        15.0    150
10   Thursday       Latte        30.0    150
11     Friday       Latte        35.0    150
12   Saturday       Latte        35.0    150
13     Sunday       Latte        35.0    150

In [126]:
coffee.dropna(subset=['Units Sold'])

          Day Coffee Type  Units Sold  Price
0      Monday    Espresso        10.0    120
1     Tuesday    Espresso        10.0    120
2   Wednesday    Espresso        35.0    120
3    Thursday    Espresso        40.0    120
4      Friday    Espresso        45.0    120
5    Saturday    Espresso        45.0    120
6      Sunday    Espresso        45.0    120
7      Monday       Latte        15.0    150
10   Thursday       Latte        30.0    150
11     Friday       Latte        35.0    150
12   Saturday       Latte        35.0    150
13     Sunday       Latte        35.0    150

In [127]:
coffee[coffee['Units Sold'].isna()]

         Day Coffee Type  Units Sold  Price
8    Tuesday       Latte         NaN    150
9  Wednesday       Latte         NaN    150

### Aggregating Data

In [128]:
bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25

In [129]:
bios['born_country'].value_counts()

born_country
USA        9641
GER        6891
GBR        5792
FRA        5143
ITA        4709
           ...
GIB           1
NFI           1
Munich        1
Altmark       1
Aarhus        1
Name: count, Length: 236, dtype: int64

In [130]:
bios[bios['born_country']=='USA']['born_region'].value_counts()

born_region
California              1634
New York                 990
Illinois                 585
Pennsylvania             530
Massachusetts            530
New Jersey               381
Texas                    368
Minnesota                365
Ohio                     328
Michigan                 319
Washington               240
Florida                  235
Wisconsin                209
Colorado                 207
Connecticut              156
Indiana                  150
Oregon                   132
Georgia                  129
Virginia                 121
Maryland                 117
District of Columbia     107
Iowa                     102
Hawaiʻi                   95
Kansas                    94
Oklahoma                  93
Louisiana                 92
Utah                      91
Missouri                  91
North Carolina            86
Arizona                   83
New Hampshire             83
Vermont                   68
Mississippi               66
Alabama                   64
Kentucky                  62
Tennessee                 62
Nebraska                  60
Rhode Island              56
Montana                   55
South Carolina            50
Maine                     50
Alaska                    45
Arkansas                  42
Idaho                     41
New Mexico                38
Nevada                    36
South Dakota              27
West Virginia             24
Delaware                  22
North Dakota              16
Wyoming                   14
Name: count, dtype: int64

In [131]:
coffee

          Day Coffee Type  Units Sold  Price
0      Monday    Espresso        10.0    120
1     Tuesday    Espresso        10.0    120
2   Wednesday    Espresso        35.0    120
3    Thursday    Espresso        40.0    120
4      Friday    Espresso        45.0    120
5    Saturday    Espresso        45.0    120
6      Sunday    Espresso        45.0    120
7      Monday       Latte        15.0    150
8     Tuesday       Latte         NaN    150
9   Wednesday       Latte         NaN    150
10   Thursday       Latte        30.0    150
11     Friday       Latte        35.0    150
12   Saturday       Latte        35.0    150
13     Sunday       Latte        35.0    150

In [139]:
coffee.groupby('Coffee Type')['Units Sold'].sum()

Coffee Type
Espresso    265
Latte       195
Name: Units Sold, dtype: int64

In [142]:
coffee.groupby('Coffee Type').agg({'Units Sold': 'sum', 'Price': 'mean'})

             Units Sold  Price
Coffee Type
Espresso            265  120.0
Latte               195  150.0

In [143]:
coffee.groupby(['Coffee Type', 'Day']).agg({'Units Sold': 'sum', 'Price': 'mean'})

                       Units Sold  Price
Coffee Type Day
Espresso    Friday             45  120.0
            Monday             25  120.0
            Saturday           45  120.0
            Sunday             45  120.0
            Thursday           40  120.0
            Tuesday            30  120.0
            Wednesday          35  120.0
Latte       Friday             35  150.0
            Monday             15  150.0
            Saturday           35  150.0
            Sunday             35  150.0
            Thursday           30  150.0
            Tuesday            20  150.0
            Wednesday          25  150.0

In [144]:
coffee['Revenue'] = coffee['Units Sold'] * coffee['Price']

In [145]:
coffee

          Day Coffee Type  Units Sold  Price  Revenue
0      Monday    Espresso          25    120     3000
1     Tuesday    Espresso          30    120     3600
2   Wednesday    Espresso          35    120     4200
3    Thursday    Espresso          40    120     4800
4      Friday    Espresso          45    120     5400
5    Saturday    Espresso          45    120     5400
6      Sunday    Espresso          45    120     5400
7      Monday       Latte          15    150     2250
8     Tuesday       Latte          20    150     3000
9   Wednesday       Latte          25    150     3750
10   Thursday       Latte          30    150     4500
11     Friday       Latte          35    150     5250
12   Saturday       Latte          35    150     5250
13     Sunday       Latte          35    150     5250

In [146]:
pivot = coffee.pivot_table(columns='Coffee Type', values='Revenue', index='Day')

In [147]:
pivot

Coffee Type  Espresso   Latte
Day
Friday         5400.0  5250.0
Monday         3000.0  2250.0
Saturday       5400.0  5250.0
Sunday         5400.0  5250.0
Thursday       4800.0  4500.0
Tuesday        3600.0  3000.0
Wednesday      4200.0  3750.0

In [148]:
pivot.sum()

Coffee Type
Espresso    31800.0
Latte       29250.0
dtype: float64

In [149]:
pivot.sum(axis=1)

Day
Friday       10650.0
Monday        5250.0
Saturday     10650.0
Sunday       10650.0
Thursday      9300.0
Tuesday       6600.0
Wednesday     7950.0
dtype: float64

In [150]:
coffee['yesterday_revenue'] = coffee['Revenue'].shift(1)

In [151]:
coffee

          Day Coffee Type  Units Sold  Price  Revenue  yesterday_revenue
0      Monday    Espresso          25    120     3000                NaN
1     Tuesday    Espresso          30    120     3600             3000.0
2   Wednesday    Espresso          35    120     4200             3600.0
3    Thursday    Espresso          40    120     4800             4200.0
4      Friday    Espresso          45    120     5400             4800.0
5    Saturday    Espresso          45    120     5400             5400.0
6      Sunday    Espresso          45    120     5400             5400.0
7      Monday       Latte          15    150     2250             5400.0
8     Tuesday       Latte          20    150     3000             2250.0
9   Wednesday       Latte          25    150     3750             3000.0
10   Thursday       Latte          30    150     4500             3750.0
11     Friday       Latte          35    150     5250             4500.0
12   Saturday       Latte          35    150     5250             5250.0
13     Sunday       Latte          35    150     5250             5250.0

In [157]:
coffee['pct_change_revenue'] = coffee['Revenue']/coffee['yesterday_revenue'] * 100

In [158]:
coffee

,Day,Coffee Type,Units Sold,Price,Revenue,yesterday_revenue,pct_change_revenue
0,Monday,Espresso,25,120,3000,NaN,NaN
1,Tuesday,Espresso,30,120,3600,3000.0,120.000000
2,Wednesday,Espresso,35,120,4200,3600.0,116.666667
3,Thursday,Espresso,40,120,4800,4200.0,114.285714
4,Friday,Espresso,45,120,5400,4800.0,112.500000
5,Saturday,Espresso,45,120,5400,5400.0,100.000000
6,Sunday,Espresso,45,120,5400,5400.0,100.000000
7,Monday,Latte,15,150,2250,5400.0,41.666667
8,Tuesday,Latte,20,150,3000,2250.0,133.333333
9,Wednesday,Latte,25,150,3750,3000.0,125.000000
10,Thursday,Latte,30,150,4500,3750.0,120.000000
11,Friday,Latte,35,150,5250,4500.0,116.666667
12,Saturday,Latte,35,150,5250,5250.0,100.000000
13,Sunday,Latte,35,150,5250,5250.0,100.000000

In [159]:
coffee['tommorow_revenue'] = coffee['Revenue'].shift(-1)

In [160]:
coffee

,Day,Coffee Type,Units Sold,Price,Revenue,yesterday_revenue,pct_change_revenue,tommorow_revenue
0,Monday,Espresso,25,120,3000,NaN,NaN,3600.0
1,Tuesday,Espresso,30,120,3600,3000.0,120.000000,4200.0
2,Wednesday,Espresso,35,120,4200,3600.0,116.666667,4800.0
3,Thursday,Espresso,40,120,4800,4200.0,114.285714,5400.0
4,Friday,Espresso,45,120,5400,4800.0,112.500000,5400.0
5,Saturday,Espresso,45,120,5400,5400.0,100.000000,5400.0
6,Sunday,Espresso,45,120,5400,5400.0,100.000000,2250.0
7,Monday,Latte,15,150,2250,5400.0,41.666667,3000.0
8,Tuesday,Latte,20,150,3000,2250.0,133.333333,3750.0
9,Wednesday,Latte,25,150,3750,3000.0,125.000000,4500.0
10,Thursday,Latte,30,150,4500,3750.0,120.000000,5250.0
11,Friday,Latte,35,150,5250,4500.0,116.666667,5250.0
12,Saturday,Latte,35,150,5250,5250.0,100.000000,5250.0
13,Sunday,Latte,35,150,5250,5250.0,100.000000,NaN

In [161]:
coffee['revenue_rank'] = coffee['Revenue'].rank()

In [163]:
coffee.sort_values(by='revenue_rank')

,Day,Coffee Type,Units Sold,Price,Revenue,yesterday_revenue,pct_change_revenue,tommorow_revenue,revenue_rank
7,Monday,Latte,15,150,2250,5400.0,41.666667,3000.0,1.0
0,Monday,Espresso,25,120,3000,NaN,NaN,3600.0,2.5
8,Tuesday,Latte,20,150,3000,2250.0,133.333333,3750.0,2.5
1,Tuesday,Espresso,30,120,3600,3000.0,120.000000,4200.0,4.0
9,Wednesday,Latte,25,150,3750,3000.0,125.000000,4500.0,5.0
2,Wednesday,Espresso,35,120,4200,3600.0,116.666667,4800.0,6.0
10,Thursday,Latte,30,150,4500,3750.0,120.000000,5250.0,7.0
3,Thursday,Espresso,40,120,4800,4200.0,114.285714,5400.0,8.0
11,Friday,Latte,35,150,5250,4500.0,116.666667,5250.0,10.0
12,Saturday,Latte,35,150,5250,5250.0,100.000000,5250.0,10.0
13,Sunday,Latte,35,150,5250,5250.0,100.000000,NaN,10.0
4,Friday,Espresso,45,120,5400,4800.0,112.500000,5400.0,13.0
5,Saturday,Espresso,45,120,5400,5400.0,100.000000,5400.0,13.0
6,Sunday,Espresso,45,120,5400,5400.0,100.000000,2250.0,13.0